# 교통수단(버스, 지하철) 최종 테이블

In [15]:
import pandas as pd

In [20]:
# 전처리된 데이터 불러오기
bus = pd.read_excel('/Users/nabong/Desktop/project_login/data/cleaned/bus_info.xlsx')
subway = pd.read_excel('/Users/nabong/Desktop/project_login/data/cleaned/subway_info.xlsx')

In [21]:
# 버스 정류장 데이터
bus.info()
bus.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11226 entries, 0 to 11225
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   node_id   11226 non-null  object
 1   정류소명(역명)  11226 non-null  object
 2   월평균승차수    10626 non-null  float64
 3   월평균하차수    10626 non-null  float64
 4   월평균승하차총계  10626 non-null  float64
 5   위도        11226 non-null  float64
 6   경도        11226 non-null  float64
dtypes: float64(5), object(2)
memory usage: 614.0+ KB

      node_id     정류소명(역명)   월평균승차수   월평균하차수  월평균승하차총계         위도          경도
0  B100000001      종로2가사거리  14645.0  13676.0   28321.0  37.569765  126.987750
1  B100000002  창경궁.서울대학교병원  81002.0  70081.0  151083.0  37.579183  126.996566

In [22]:
# 지하철 데이터
subway.info()
subway.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 401 entries, 0 to 400
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   node_id   401 non-null    object
 1   정류소명(역명)  401 non-null    object
 2   월평균승차수    260 non-null    float64
 3   월평균하차수    260 non-null    float64
 4   월평균승하차총계  260 non-null    float64
 5   위도        401 non-null    float64
 6   경도        401 non-null    float64
dtypes: float64(5), object(2)
memory usage: 22.1+ KB

  node_id 정류소명(역명)     월평균승차수      월평균하차수    월평균승하차총계         위도          경도
0    S150      서울역  1301736.5  1264329.75  2566066.25  37.556228  126.972135
1    S151       시청   625330.5   632575.33  1257905.83  37.565715  126.977088

In [23]:
# 데이터 합치기
df = pd.concat([bus, subway]).reset_index(drop=True)
print(bus.shape, subway.shape, df.shape)
df.tail(2)

(11226, 7) (401, 7) (11627, 7)

      node_id 정류소명(역명)  월평균승차수  월평균하차수  월평균승하차총계         위도          경도
11625   S1002       남영     NaN     NaN       NaN  37.541021  126.971300
11626   S1001      서울역     NaN     NaN       NaN  37.554337  126.971134

In [24]:
# 중복 좌표 확인
df[df.duplicated(['위도', '경도'], keep=False)==True].sort_values('위도')

,node_id,정류소명(역명),월평균승차수,월평균하차수,월평균승하차총계,위도,경도
11516,S4306,신논현,NaN,NaN,NaN,37.504598,127.025060
11538,S4125,신논현,NaN,NaN,NaN,37.504598,127.025060
11399,S2734,논현,491173.67,525086.33,1016260.0,37.511093,127.021415
11517,S4305,논현,NaN,NaN,NaN,37.511093,127.021415
11444,S327,신사,808461.92,847208.58,1655670.5,37.516334,127.020114
11518,S4304,신사,NaN,NaN,NaN,37.516334,127.020114
11581,S1292,공덕,NaN,NaN,NaN,37.542596,126.952099
11588,S1262,공덕,NaN,NaN,NaN,37.542596,126.952099
11582,S1291,서울역,NaN,NaN,NaN,37.557231,126.971030
11591,S1251,서울역,NaN,NaN,NaN,37.557231,126.971030
11337,S2562,강일,124707.42,118060.08,242767.5,37.557490,127.175930
11486,S9995,강일,NaN,NaN,NaN,37.557490,127.175930
11580,S1293,홍대입구,NaN,NaN,NaN,37.557641,126.926683
11586,S1264,홍대입구,NaN,NaN,NaN,37.557641,126.926683
11579,S1294,디지털미디어시티,NaN,NaN,NaN,37.577475,126.900453
11584,S1266,디지털미디어시티,NaN,NaN,NaN,37.577475,126.900453

In [25]:
print('드롭 전 행의 수: ', df.shape[0])
df = df.drop_duplicates([ '위도', '경도' ], keep='first')
print('드롭 후 행의 수: ', df.shape[0])

드롭 전 행의 수:  11627
드롭 후 행의 수:  11619

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11619 entries, 0 to 11626
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   node_id   11619 non-null  object
 1   정류소명(역명)  11619 non-null  object
 2   월평균승차수    10886 non-null  float64
 3   월평균하차수    10886 non-null  float64
 4   월평균승하차총계  10886 non-null  float64
 5   위도        11619 non-null  float64
 6   경도        11619 non-null  float64
dtypes: float64(5), object(2)
memory usage: 726.2+ KB

In [27]:
df.to_excel('transport_info.xlsx', index=False)